In [2]:
import pandas as pd

In [3]:
proj = pd.read_csv('CSV_4.csv')

In [4]:
proj.head()

,ID,Candidate,Gender,credit card type,passion,Educational institution
0,1,Enoch Nayler,M,Bank of America,Hard Rock,Junior college
1,2,Ethan Terry,M,American Express,Blues,University-preparatory school
2,3,Ryan Newman,M,Maestro,Blues,University-preparatory school
3,4,Noemi Bradley,F,UnionPay,Dubstep,University-preparatory school
4,5,Rita Doherty,F,Capital One,Hard Rock,Gymnasium

In [5]:
proj.value_counts()

ID    Candidate       Gender  credit card type  passion    Educational institution
1     Enoch Nayler    M       Bank of America   Hard Rock  Junior college                   1
672   Carrie Eddison  F       Citibank          Hip-Hop    Junior college                   1
659   Callie Donovan  F       Discover          Pop        Graduate school                  1
660   Liam Miller     M       Discover          House      Technical college                1
661   Barry Clark     M       UnionPay          Opera      Corporate university             1
                                                                                           ..
339   Johnny Rees     M       Wells Fargo       Jazz       Gymnasium                        1
340   Gwen Wilkinson  F       Bank of America   Pop        Gymnasium                        1
341   Harry Wilson    M       Maestro           Country    University-preparatory school    1
342   Helen Widdows   F       Capital One       Pop        University college               1
1000  Agnes Wigley    F       Bank of America   House      Graduate school                  1
Length: 1000, dtype: int64

In [6]:
pd.isnull(proj)

,ID,Candidate,Gender,credit card type,passion,Educational institution
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
995,False,False,False,False,False,False
996,False,False,False,False,False,False
997,False,False,False,False,False,False
998,False,False,False,False,False,False
999,False,False,False,False,False,False

In [7]:
proj.isna().sum().sum()

0

In [222]:
proj.groupby(by='Candidate', as_index=False).agg({'ID': pd.Series.nunique})

           Candidate  ID
0      Abdul Cassidy   1
1         Abdul Dale   1
2         Ada Bailey   1
3         Ada Ulyatt   1
4          Ada Umney   1
..               ...  ..
993     William Swan   1
994   William Thomas   1
995   Willow Furnell   1
996     Willow Lynch   1
997  Willow Robinson   1

[998 rows x 2 columns]

In [223]:
proj['Gender'].unique()

array(['M', 'F'], dtype=object)

In [224]:
proj['credit card type'].unique()

array(['Bank of America', 'American Express', 'Maestro', 'UnionPay',
       'Capital One', 'Discover', 'Visa', 'Chase', 'Citibank',
       'Wells Fargo', 'MasterCard'], dtype=object)

In [225]:
proj['passion'].unique()

array(['Hard Rock', 'Blues', 'Dubstep', 'Soul', 'House', 'Pop', 'Latin',
       'Opera', 'Country', 'Reggae', 'Techno', 'Hip-Hop', 'Jazz',
       'Baroque', 'Drum & Bass'], dtype=object)

In [226]:
proj['Educational institution'].unique()

array(['Junior college', 'University-preparatory school', 'Gymnasium',
       'Public university', 'Graduate school', 'Technical college',
       'High school', 'Middle school', 'University college',
       'Corporate university'], dtype=object)

In [9]:
proj.rename(columns={'Educational institution': 'Educational_institution'}, inplace=True)

In [10]:
proj.rename(columns={'credit card type': 'credit_card_type'}, inplace=True)

In [11]:
proj.head()

,ID,Candidate,Gender,credit_card_type,passion,Educational_institution
0,1,Enoch Nayler,M,Bank of America,Hard Rock,Junior college
1,2,Ethan Terry,M,American Express,Blues,University-preparatory school
2,3,Ryan Newman,M,Maestro,Blues,University-preparatory school
3,4,Noemi Bradley,F,UnionPay,Dubstep,University-preparatory school
4,5,Rita Doherty,F,Capital One,Hard Rock,Gymnasium

In [115]:
Candidate = pd.DataFrame({'idU': proj['ID'],'Candidates': proj['Candidate'],'Gender': proj['Gender']})
Candidate.reset_index()
Candidate = Candidate.set_index('idU')
Candidate.head(3)

       Candidates Gender
idU
1    Enoch Nayler      M
2     Ethan Terry      M
3     Ryan Newman      M

In [116]:
Candidate.to_csv('candidate.csv')
# csv de Candidate Ã  rajouter les id bank passion education

In [ ]:
# preparation csv bank

In [32]:
Bank_of_America =  proj[proj['credit_card_type']=='Bank of America']
American_Express = proj[proj['credit_card_type']=='American Express']
Maestro =  proj[proj['credit_card_type']=='Maestro']
UnionPay = proj[proj['credit_card_type']=='UnionPay']
Capital_One =  proj[proj['credit_card_type']=='Capital One']
Discover = proj[proj['credit_card_type']=='Discover']
Visa =  proj[proj['credit_card_type']=='Visa']
Chase = proj[proj['credit_card_type']=='Chase']
Citibank =  proj[proj['credit_card_type']=='Citibank']
Wells_Fargo = proj[proj['credit_card_type']=='Wells Fargo']
MasterCard =  proj[proj['credit_card_type']=='MasterCard']

credit_card_type = pd.DataFrame({'credit_card_type': proj['credit_card_type'].unique()})
credit_card_type.reset_index()

# attribuer un id Ã  chaque banque puis genere un index que je vais transformer en id

    index  credit_card_type
0       0   Bank of America
1       1  American Express
2       2           Maestro
3       3          UnionPay
4       4       Capital One
5       5          Discover
6       6              Visa
7       7             Chase
8       8          Citibank
9       9       Wells Fargo
10     10        MasterCard

In [21]:
credit_card_type.to_csv('ie.csv')

In [33]:
credit_card_type = pd.read_csv('ie.csv')

In [34]:
credit_card_type

    Unnamed: 0  credit_card_type
0            0   Bank of America
1            1  American Express
2            2           Maestro
3            3          UnionPay
4            4       Capital One
5            5          Discover
6            6              Visa
7            7             Chase
8            8          Citibank
9            9       Wells Fargo
10          10        MasterCard

In [35]:
credit_card_type.rename( columns={'Unnamed: 0':'idBank'}, inplace=True )

# change le nom de la colonne en idBank

In [39]:
credit_card_type

    idBank  credit_card_type
0        0   Bank of America
1        1  American Express
2        2           Maestro
3        3          UnionPay
4        4       Capital One
5        5          Discover
6        6              Visa
7        7             Chase
8        8          Citibank
9        9       Wells Fargo
10      10        MasterCard

In [40]:
credit_card_type.to_csv('lie.csv')

In [51]:
cc = pd.DataFrame({'idBank':credit_card_type['idBank'],'credit_card_type':credit_card_type['credit_card_type']})

In [52]:
cc

    idBank  credit_card_type
0        0   Bank of America
1        1  American Express
2        2           Maestro
3        3          UnionPay
4        4       Capital One
5        5          Discover
6        6              Visa
7        7             Chase
8        8          Citibank
9        9       Wells Fargo
10      10        MasterCard

In [81]:
#credit_card_type = credit_card_type.set_index('idBank')

# supprime la colonne inutile

In [68]:
credit_card_type

        credit_card_type
idBank
0        Bank of America
1       American Express
2                Maestro
3               UnionPay
4            Capital One
5               Discover
6                   Visa
7                  Chase
8               Citibank
9            Wells Fargo
10            MasterCard

In [64]:
credit_card_type.to_csv('efcd.csv')
# fichier csv correct mais commence Ã  0 donc faire + 1

In [74]:
credit_card_type.index = credit_card_type.index +1

In [76]:
credit_card_type

        credit_card_type
idBank
1        Bank of America
2       American Express
3                Maestro
4               UnionPay
5            Capital One
6               Discover
7                   Visa
8                  Chase
9               Citibank
10           Wells Fargo
11            MasterCard

In [80]:
credit_card_type.to_csv('credit.csv')

In [82]:
# creation du csv passion

proj['passion'].unique()

array(['Hard Rock', 'Blues', 'Dubstep', 'Soul', 'House', 'Pop', 'Latin',
       'Opera', 'Country', 'Reggae', 'Techno', 'Hip-Hop', 'Jazz',
       'Baroque', 'Drum & Bass'], dtype=object)

In [93]:
passion = pd.DataFrame({'nomPassion': proj['passion'].unique()})

In [94]:
passion

     nomPassion
0     Hard Rock
1         Blues
2       Dubstep
3          Soul
4         House
5           Pop
6         Latin
7         Opera
8       Country
9        Reggae
10       Techno
11      Hip-Hop
12         Jazz
13      Baroque
14  Drum & Bass

In [95]:
passion.to_csv('id.csv')

In [96]:
passion = pd.read_csv('id.csv')

In [97]:
passion

    Unnamed: 0   nomPassion
0            0    Hard Rock
1            1        Blues
2            2      Dubstep
3            3         Soul
4            4        House
5            5          Pop
6            6        Latin
7            7        Opera
8            8      Country
9            9       Reggae
10          10       Techno
11          11      Hip-Hop
12          12         Jazz
13          13      Baroque
14          14  Drum & Bass

In [98]:
passion.rename( columns={'Unnamed: 0':'idPassion'}, inplace=True )

In [99]:
passion

    idPassion   nomPassion
0           0    Hard Rock
1           1        Blues
2           2      Dubstep
3           3         Soul
4           4        House
5           5          Pop
6           6        Latin
7           7        Opera
8           8      Country
9           9       Reggae
10         10       Techno
11         11      Hip-Hop
12         12         Jazz
13         13      Baroque
14         14  Drum & Bass

In [100]:
passion = passion.set_index('idPassion')

In [101]:
passion

            nomPassion
idPassion
0            Hard Rock
1                Blues
2              Dubstep
3                 Soul
4                House
5                  Pop
6                Latin
7                Opera
8              Country
9               Reggae
10              Techno
11             Hip-Hop
12                Jazz
13             Baroque
14         Drum & Bass

In [123]:
passion.index = passion.index +1

In [124]:
passion.to_csv('passion.csv')

In [104]:
# csv institution
proj['Educational_institution'].unique()

array(['Junior college', 'University-preparatory school', 'Gymnasium',
       'Public university', 'Graduate school', 'Technical college',
       'High school', 'Middle school', 'University college',
       'Corporate university'], dtype=object)

In [129]:
institution = pd.DataFrame({'Education': proj['Educational_institution'].unique()})

In [130]:
institution

                       Education
0                 Junior college
1  University-preparatory school
2                      Gymnasium
3              Public university
4                Graduate school
5              Technical college
6                    High school
7                  Middle school
8             University college
9           Corporate university

In [131]:
institution.to_csv('inst.csv')

In [132]:
institution = pd.read_csv('inst.csv')

In [133]:
institution

   Unnamed: 0                      Education
0           0                 Junior college
1           1  University-preparatory school
2           2                      Gymnasium
3           3              Public university
4           4                Graduate school
5           5              Technical college
6           6                    High school
7           7                  Middle school
8           8             University college
9           9           Corporate university

In [134]:
institution.rename( columns={'Unnamed: 0':'idInstitution'}, inplace=True )

In [135]:
institution

   idInstitution                      Education
0              0                 Junior college
1              1  University-preparatory school
2              2                      Gymnasium
3              3              Public university
4              4                Graduate school
5              5              Technical college
6              6                    High school
7              7                  Middle school
8              8             University college
9              9           Corporate university

In [136]:
institution = institution.set_index('idInstitution')

In [137]:
institution

                                   Education
idInstitution
0                             Junior college
1              University-preparatory school
2                                  Gymnasium
3                          Public university
4                            Graduate school
5                          Technical college
6                                High school
7                              Middle school
8                         University college
9                       Corporate university

In [139]:
institution.index = institution.index +1

In [140]:
institution.to_csv('institution.csv')

In [146]:
ins = pd.read_csv('institution.csv')
ins

   idInstitution                      Education
0              1                 Junior college
1              2  University-preparatory school
2              3                      Gymnasium
3              4              Public university
4              5                Graduate school
5              6              Technical college
6              7                    High school
7              8                  Middle school
8              9             University college
9             10           Corporate university

In [148]:
poisson = pd.read_csv('passion.csv')
poisson

    idPassion   nomPassion
0           1    Hard Rock
1           2        Blues
2           3      Dubstep
3           4         Soul
4           5        House
5           6          Pop
6           7        Latin
7           8        Opera
8           9      Country
9          10       Reggae
10         11       Techno
11         12      Hip-Hop
12         13         Jazz
13         14      Baroque
14         15  Drum & Bass

In [150]:
cred = pd.read_csv('credit.csv')
cred

    idBank  credit_card_type
0        1   Bank of America
1        2  American Express
2        3           Maestro
3        4          UnionPay
4        5       Capital One
5        6          Discover
6        7              Visa
7        8             Chase
8        9          Citibank
9       10       Wells Fargo
10      11        MasterCard

Preparation des valeurs

In [188]:
proj.head()

,ID,Candidate,Gender,credit_card_type,passion,Educational_institution
0,1,Enoch Nayler,M,Bank of America,Hard Rock,Junior college
1,2,Ethan Terry,M,American Express,Blues,University-preparatory school
2,3,Ryan Newman,M,Maestro,Blues,University-preparatory school
3,4,Noemi Bradley,F,UnionPay,Dubstep,University-preparatory school
4,5,Rita Doherty,F,Capital One,Hard Rock,Gymnasium

In [194]:
proj['credit_card_type'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11], dtype=int64)

In [193]:
proj['credit_card_type'] = proj['credit_card_type'].replace('Bank of America',1)
proj['credit_card_type'] = proj['credit_card_type'].replace('American Express',2)
proj['credit_card_type'] = proj['credit_card_type'].replace('Maestro',3)
proj['credit_card_type'] = proj['credit_card_type'].replace('UnionPay',4)
proj['credit_card_type'] = proj['credit_card_type'].replace('Capital One',5)
proj['credit_card_type'] = proj['credit_card_type'].replace('Discover',6)
proj['credit_card_type'] = proj['credit_card_type'].replace('Visa',7)
proj['credit_card_type'] = proj['credit_card_type'].replace('Chase',8)
proj['credit_card_type'] = proj['credit_card_type'].replace('Citibank',9)
proj['credit_card_type'] = proj['credit_card_type'].replace('Wells Fargo',10)
proj['credit_card_type'] = proj['credit_card_type'].replace('MasterCard',11)

In [199]:
proj['passion'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15],
      dtype=int64)

In [198]:
proj['passion'] = proj['passion'].replace('Hard Rock',1)
proj['passion'] = proj['passion'].replace('Blues',2)
proj['passion'] = proj['passion'].replace('Dubstep',3)
proj['passion'] = proj['passion'].replace('Soul',4)
proj['passion'] = proj['passion'].replace('House',5)
proj['passion'] = proj['passion'].replace('Pop',6)
proj['passion'] = proj['passion'].replace('Latin',7)
proj['passion'] = proj['passion'].replace('Opera',8)
proj['passion'] = proj['passion'].replace('Country',9)
proj['passion'] = proj['passion'].replace('Reggae',10)
proj['passion'] = proj['passion'].replace('Techno',11)
proj['passion'] = proj['passion'].replace('Hip-Hop',12)
proj['passion'] = proj['passion'].replace('Jazz',13)
proj['passion'] = proj['passion'].replace('Baroque',14)
proj['passion'] = proj['passion'].replace('Drum & Bass',15)

In [203]:
proj['Educational_institution'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10], dtype=int64)

In [202]:
proj['Educational_institution'] = proj['Educational_institution'].replace('Junior college', 1)
proj['Educational_institution'] = proj['Educational_institution'].replace('University-preparatory school', 2)
proj['Educational_institution'] = proj['Educational_institution'].replace('Gymnasium', 3)
proj['Educational_institution'] = proj['Educational_institution'].replace('Public university', 4)
proj['Educational_institution'] = proj['Educational_institution'].replace('Graduate school', 5)
proj['Educational_institution'] = proj['Educational_institution'].replace('Technical college', 6)
proj['Educational_institution'] = proj['Educational_institution'].replace('High school', 7)
proj['Educational_institution'] = proj['Educational_institution'].replace('Middle school', 8)
proj['Educational_institution'] = proj['Educational_institution'].replace('University college',9)
proj['Educational_institution'] = proj['Educational_institution'].replace('Corporate university',10)

In [204]:
proj.head()

,ID,Candidate,Gender,credit_card_type,passion,Educational_institution
0,1,Enoch Nayler,M,1,1,1
1,2,Ethan Terry,M,2,2,2
2,3,Ryan Newman,M,3,2,2
3,4,Noemi Bradley,F,4,3,2
4,5,Rita Doherty,F,5,1,3

In [179]:
merge = pd.DataFrame({'idBank': cred['idBank'],'idPassion':poisson['idPassion'],'idInstitution':ins['idInstitution']})

In [180]:
merge

    idBank  idPassion  idInstitution
0      1.0          1            1.0
1      2.0          2            2.0
2      3.0          3            3.0
3      4.0          4            4.0
4      5.0          5            5.0
5      6.0          6            6.0
6      7.0          7            7.0
7      8.0          8            8.0
8      9.0          9            9.0
9     10.0         10           10.0
10    11.0         11            NaN
11     NaN         12            NaN
12     NaN         13            NaN
13     NaN         14            NaN
14     NaN         15            NaN

In [181]:
merge.dtypes

idBank           float64
idPassion          int64
idInstitution    float64
dtype: object

In [184]:
#import numpy as np
#merge = merge.replace(np.nan, '', regex=True)

In [185]:
merge

    idBank  idPassion  idInstitution
0      1.0          1            1.0
1      2.0          2            2.0
2      3.0          3            3.0
3      4.0          4            4.0
4      5.0          5            5.0
5      6.0          6            6.0
6      7.0          7            7.0
7      8.0          8            8.0
8      9.0          9            9.0
9     10.0         10           10.0
10    11.0         11            NaN
11     NaN         12            NaN
12     NaN         13            NaN
13     NaN         14            NaN
14     NaN         15            NaN

In [186]:
bloc = merge.set_index('idBank')

In [187]:
bloc.to_csv('bloc.csv')

In [176]:
merge['idBank']

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0
10    11.0
11
12
13
14
Name: idBank, dtype: object

In [ ]:
# reste Ã  rajouter les colonnes dans la table principale et d'y transformer les valeurs en entier

In [147]:

print(ins['idInstitution'])
#passion = pd.DataFrame({'passion': proj['passion'].unique()}

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: idInstitution, dtype: int64

In [297]:
credit_card_type = pd.DataFrame({'idh': proj['ID'],'credit_card_types': proj['credit_card_type']})
credit_card_type.reset_index()

     index   idh credit_card_types
0        0     1   Bank of America
1        1     2  American Express
2        2     3           Maestro
3        3     4          UnionPay
4        4     5       Capital One
..     ...   ...               ...
995    995   996       Wells Fargo
996    996   997          UnionPay
997    997   998  American Express
998    998   999          UnionPay
999    999  1000   Bank of America

[1000 rows x 3 columns]

In [299]:
credit_card_type = pd.read_csv('credit.csv', index_col=1)

In [300]:
credit_card_type

      Unnamed: 0  credit_card_type
idh
1              0   Bank of America
2              1  American Express
3              2           Maestro
4              3          UnionPay
5              4       Capital One
...          ...               ...
996          995       Wells Fargo
997          996          UnionPay
998          997  American Express
999          998          UnionPay
1000         999   Bank of America

[1000 rows x 2 columns]

In [293]:
credit_card_type.rename( columns={'credit_card_type':'credit_card_types'}, inplace=True )
credit_card_type.rename( columns={'Unnamed: 0':'idBank'}, inplace=True )
credit_card_type

      idBank credit_card_types
idh
1          0   Bank of America
2          1  American Express
3          2           Maestro
4          3          UnionPay
5          4       Capital One
...      ...               ...
996      995       Wells Fargo
997      996          UnionPay
998      997  American Express
999      998          UnionPay
1000     999   Bank of America

[1000 rows x 2 columns]

In [294]:
credit_card_type.to_csv('credit_card_type.csv')

In [295]:

#Bank_of_America =  proj[proj['credit_card_type']=='Bank of America']
# American_Express = proj[proj['credit_card_type']=='American Express']
# Maestro =  proj[proj['credit_card_type']=='Maestro']
# UnionPay = proj[proj['credit_card_type']=='UnionPay']
# Capital_One =  proj[proj['credit_card_type']=='Capital One']
# Discover = proj[proj['credit_card_type']=='Discover']
# Visa =  proj[proj['credit_card_type']=='Visa']
# Chase = proj[proj['credit_card_type']=='Chase']
# Citibank =  proj[proj['credit_card_type']=='Citibank']
# Wells_Fargo = proj[proj['credit_card_type']=='Wells Fargo']
# MasterCard =  proj[proj['credit_card_type']=='MasterCard']

#credit_card_type = pd.DataFrame({'credit_card_type': proj['credit_card_type'].unique()})
#credit_card_type.reset_index()

In [434]:
passion = pd.DataFrame({'idh': proj['ID'],'passions': proj['passion']})
passion.reset_index()

     index   idh   passions
0        0     1  Hard Rock
1        1     2      Blues
2        2     3      Blues
3        3     4    Dubstep
4        4     5  Hard Rock
..     ...   ...        ...
995    995   996        Pop
996    996   997     Techno
997    997   998      House
998    998   999        Pop
999    999  1000      House

[1000 rows x 3 columns]

In [435]:

#passion.rename( columns={'index':'IdPassion'}, inplace=True )
#passion
passi = pd.read_csv('passio.csv', index_col=2)

In [436]:
passi

      Unnamed: 0   passions
idh
1              0  Hard Rock
2              1      Blues
3              2      Blues
4              3    Dubstep
5              4  Hard Rock
...          ...        ...
996          995        Pop
997          996     Techno
998          997      House
999          998        Pop
1000         999      House

[1000 rows x 2 columns]

In [437]:
passi.rename( columns={'idh':'IdPassion'}, inplace=True )
passi.rename( columns={'Unnamed: 0':'id'}, inplace=True )
passi

       id   passions
idh
1       0  Hard Rock
2       1      Blues
3       2      Blues
4       3    Dubstep
5       4  Hard Rock
...   ...        ...
996   995        Pop
997   996     Techno
998   997      House
999   998        Pop
1000  999      House

[1000 rows x 2 columns]

In [438]:
passi
passi.to_csv('pa.csv')
#pas enlever

In [413]:
#passion = pd.DataFrame({'passion': proj['passion'].unique()})
#passion.reset_index()

In [442]:

Educational_institution = pd.DataFrame({'index': proj['ID'],'Educational_institution': proj['Educational_institution'], 'idh': proj['ID']})
Educational_institution.reset_index(drop=False)

     level_0  index        Educational_institution   idh
0          0      1                 Junior college     1
1          1      2  University-preparatory school     2
2          2      3  University-preparatory school     3
3          3      4  University-preparatory school     4
4          4      5                      Gymnasium     5
..       ...    ...                            ...   ...
995      995    996           Corporate university   996
996      996    997                Graduate school   997
997      997    998              Public university   998
998      998    999  University-preparatory school   999
999      999   1000                Graduate school  1000

[1000 rows x 4 columns]

In [443]:
Educational_institution

     index        Educational_institution   idh
0        1                 Junior college     1
1        2  University-preparatory school     2
2        3  University-preparatory school     3
3        4  University-preparatory school     4
4        5                      Gymnasium     5
..     ...                            ...   ...
995    996           Corporate university   996
996    997                Graduate school   997
997    998              Public university   998
998    999  University-preparatory school   999
999   1000                Graduate school  1000

[1000 rows x 3 columns]

In [444]:
Educational_institution

     index        Educational_institution   idh
0        1                 Junior college     1
1        2  University-preparatory school     2
2        3  University-preparatory school     3
3        4  University-preparatory school     4
4        5                      Gymnasium     5
..     ...                            ...   ...
995    996           Corporate university   996
996    997                Graduate school   997
997    998              Public university   998
998    999  University-preparatory school   999
999   1000                Graduate school  1000

[1000 rows x 3 columns]

In [422]:

#Educational_institution.to_csv('Educatio.csv')